; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-70)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b21)
    (on b21 b4)
    (on b4 b10)
    (on b10 b3)
    (on b3 b11)
    (on b11 b20)
    (on b20 b9)
    (on b9 b8)
    (on b8 b16)
    (on b16 b15)
    (on b15 b6)
    (on b6 b5)
    (on b5 b19)
    (on b19 b17)
    (on b17 b18)
    (on b18 b1)
    (on b1 b2)
    (on b2 b12)
    (on b12 b14)
    (on-table b14)
    (clear b7)
    (on-table b7))
 (:goal (and 
(on-table b14)
(on-table b13)
(clear b16) (on-table b16)
(on-table b15)
(clear b19) (on-table b19)
(on-table b17)
))
)

; plan
1. (unstack b13 b21)
   deleted: (on b13 b21) (clear b13) (arm-empty)
   added: (holding b13) (clear b21)
   goals met: 1 of 8
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 8
3. (unstack b21 b4)
   deleted: (on b21 b4) (clear b21) (arm-empty)
   added: (holding b21) (clear b4)
   goals met: 2 of 8
4. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 8
5. (unstack b4 b10)
   deleted: (on b4 b10) (clear b4) (arm-empty)
   added: (holding b4) (clear b10)
   goals met: 2 of 8
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 8
7. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 2 of 8
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 8
9. (unstack b3 b11)
   deleted: (on b3 b11) (clear b3) (arm-empty)
   added: (holding b3) (clear b11)
   goals met: 2 of 8
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 8
11. (unstack b11 b20)
   deleted: (on b11 b20) (clear b11) (arm-empty)
   added: (holding b11) (clear b20)
   goals met: 2 of 8
12. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 2 of 8
13. (unstack b20 b9)
   deleted: (on b20 b9) (clear b20) (arm-empty)
   added: (holding b20) (clear b9)
   goals met: 2 of 8
14. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 8
15. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 2 of 8
16. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 8
17. (unstack b8 b16)
   deleted: (on b8 b16) (clear b8) (arm-empty)
   added: (holding b8) (clear b16)
   goals met: 3 of 8
18. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 8
19. (unstack b16 b15)
   deleted: (on b16 b15) (clear b16) (arm-empty)
   added: (holding b16) (clear b15)
   goals met: 2 of 8
20. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 4 of 8
21. (unstack b15 b6)
   deleted: (on b15 b6) (clear b15) (arm-empty)
   added: (holding b15) (clear b6)
   goals met: 4 of 8
22. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 8
23. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 5 of 8
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 8
25. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 6 of 8
26. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 8
27. (unstack b19 b17)
   deleted: (on b19 b17) (clear b19) (arm-empty)
   added: (holding b19) (clear b17)
   goals met: 5 of 8
28. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 7 of 8
29. (unstack b17 b18)
   deleted: (on b17 b18) (clear b17) (arm-empty)
   added: (holding b17) (clear b18)
   goals met: 7 of 8
30. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 8 of 8
